delehub/Open-source-MCU-design-sharing/STC12系列代码模板/STC12C5A60S2_UART.C
#include"MAIN.H"
#include"STC12C5A60S2_UART.H"


void init_com(void)		 	//9600bps@11.0592MHz
	
{
	PCON &= 0x7F;		//波特率不倍速
	SCON = 0x50;		//8位数据,可变波特率
	AUXR &= 0xFB;		//独立波特率发生器时钟为Fosc/12,即12T
	BRT = 0xFD;		//设定独立波特率发生器重装值
	AUXR |= 0x01;		//串口1选择独立波特率发生器为波特率发生器
	AUXR |= 0x10;		//启动独立波特率发生器
	
	ES=1;
	EA=1;
}


//*********************************************************************************** 
//串口发送函数 
//*********************************************************************************** 
void send_char( unsigned char ch1) 
{ 
    SBUF=ch1; //将待发数据放到SBUF 
    while (TI== 0); //等待TI＝1（表示帧发送结束）发送 
    TI= 0 ; //此步必不可少,因为硬件不能将其置0 
}

//*********************************************************************************** 
//串口发送字符串
//*********************************************************************************** 
void UART_SendString(unsigned char *String)
{
    while(*String)
    {
        send_char(*String);
        String++;
    }
}

//*********************************************************************************** 
//串口发送换行
//*********************************************************************************** 
void UART_SendLine(void)
{
    send_char(0x0D);
    send_char(0x0A);
}

//*********************************************************************************** 
//串口发送整型数字
//*********************************************************************************** 
void UART_SendIntNumber(int Number)
{
    unsigned char NumbArray[6]={0};    // 定义局部数组，用于数据存储
    if(Number<0)
    {
        Number=0-Number;
        send_char('-');
    }
    else
    {
        send_char('+');
    }
    
    NumbArray[0]=(Number/10000)%10+0x30; 
    NumbArray[1]=(Number/1000) %10+0x30;
    NumbArray[2]=(Number/100)  %10+0x30;
    NumbArray[3]=(Number/10)   %10+0x30;
    NumbArray[4]=(Number/1)    %10+0x30; 
    NumbArray[5]= 0;     
    UART_SendString(NumbArray);
}

//*********************************************************************************** 
//串口发送浮点型数字
//*********************************************************************************** 
void UART_SendFloatNumber(float Number)
{
    unsigned char NumberArray[11]={0};              // 定义局部数组，用于数据存储
    unsigned char i=1;                              // 定义局部变量，记录整数位数
    long j=1;
    unsigned int Real_Int=0;                        // 定义局部变量，记录整数部分
    unsigned int Real_Dec=0;                        // 定义局部变量，记录小数部分

    double Deci=0;                                  // 定义局部数组，暂存小数数值
    
    //----------------------------------------------------------------------------------------------
    // 判断 浮点数字正负
    //----------------------------------------------------------------------------------------------
    if(Number<0)
    {
        Number=0-Number;
        send_char('-');
    }
    else
    {
        send_char('+');
    }

    //----------------------------------------------------------------------------------------------
    // 分离 整数位与小数位
    //----------------------------------------------------------------------------------------------
    Real_Int=(int)Number;                           // 取整数部分
    Deci    =Number-Real_Int;                       // 取小数部分
    Real_Dec=(unsigned int)(Deci*1e4);              // 小数变整型数字，1e4科学计数法


    //----------------------------------------------------------------------------------------------
    // 串口输出
    //----------------------------------------------------------------------------------------------
    NumberArray[0] = (Real_Int/10000)%10+0x30;
    NumberArray[1] = (Real_Int/1000) %10+0x30;
    NumberArray[2] = (Real_Int/100)  %10+0x30;
    NumberArray[3] = (Real_Int/10)   %10+0x30;
    NumberArray[4] = (Real_Int/1)    %10+0x30;
    NumberArray[5] = '.';
    NumberArray[6] = (Real_Dec/1000)%10+0x30;
    NumberArray[7] = (Real_Dec/100) %10+0x30;
    NumberArray[8] = (Real_Dec/10)  %10+0x30;
    NumberArray[9] = (Real_Dec/1)   %10+0x30;
    NumberArray[10]= 0;

    UART_SendString(NumberArray);
}